---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.GetEnumerator
source: html/b2f08286-7059-b0f5-f60a-744af3f19c13.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<KeyValuePair<ExportLineweightKey, ExportLineweightInfo>> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.